{
  "backend/main.mo": "Empty Motoko actor with no methods or state, serving as a minimal backend placeholder.",
  "feature_evidence.json": "Feature evidence report documenting a canister deployment fix feature with high confidence, referencing frontend/index.html and multiple components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing a romantic apology website for Maham with interactive name reveal, animated hearts, and blue flowers.",
  "frontend/index.css": "Tailwind CSS base configuration with OKLCH color system variables for light and dark themes, defining design tokens for borders, backgrounds, and UI components.",
  "frontend/index.html": "HTML entry point for the React application titled 'Maham Apology Website' with standard meta tags and module script reference.",
  "frontend/src/App.tsx": "Main React component implementing an interactive apology reveal with clickable 'Maham' name, animated hearts, 30 randomly positioned blue flowers, and heartfelt apology message.",
  "frontend/src/hooks/useActor.ts": "React hook managing ICP actor creation with Internet Identity authentication, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file with no backend query implementations, as this is a frontend-only application.",
  "frontend/src/index.css": "Global styles with pink/red romantic gradient background, Playfair Display and Inter fonts, OKLCH color tokens, and custom animations for fade-in, reveal, and floating flower effects.",
  "frontend/src/main.tsx": "React application entry point initializing QueryClient and InternetIdentityProvider, rendering the App component with necessary provider wrappers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with OKLCH color palette, Playfair Display serif font, custom glow shadow, and accordion animations using typography and animate plugins.",
  "project_state.json": "Project state file tracking a canister deployment error (Error 400) that requires republishing to fix. Contains one existing feature focused on resolving the deployment issue and generating a valid working URL."
}